// !window
//   * глобальный обьект - представляет переменные и функции,
//   *доступнфе в любой части сценария

// !DOM - строится на основе HTML
// !Узлы DOM дереве
// * все что в коде:
// * - основые теги
// * - текст в них
// * - атрибуты

const linkEl = document.querySelector('a[href="https://it.com]');
//  * квадратные скобки указывают что мы ещем по АТРИБУТУ

// !closest
//* выполняет поиск ближашего родительского элемента,
//  * соответсвующего СЕЛЕКТОРА
//  *Этот метод хорош когда несколько одинаковых
//  *элементнов с одинаковыми классами

//    !СВОЙСВА УЗЛОВ
// !el.nodeType -
// *тип узла: елемент, текс, коментарий

// !el.innerHTML
//   *- показывает все содержимое в этом элементе, и текст и другие элементыж

// !el.outerHTML -
//   * все и сам элемент;
// !el.textContent-
//    *
//   !el.hidden -
//  * видимость уз
ла;
